# Расписание звонков
CALLS = {
    "1": {"start": "08:00", "end": "09:35"},  # Во вторник 1-я пара начинается в 09:00
    "2": {"start": "09:45", "end": "11:20"},
    "3": {"start": "12:00", "end": "13:35"},
    "4": {"start": "13:45", "end": "15:20"}
}

# Информация о предметах (ссылки на Zoom и Classroom можно будет вставить позже)
SUBJECTS = {
    "Виховна": {"teacher": "Не вказано", "zoom": "", "classroom": ""},
    "Фізвиховання": {"teacher": "Не вказано", "zoom": "", "classroom": ""},
    "Ін. мова 12а/преп": {"teacher": "Не вказано", "zoom": "", "classroom": ""},
    "Укр. Мова": {"teacher": "Не вказано", "zoom": "", "classroom": ""},
    "Біологія": {"teacher": "Не вказано", "zoom": "", "classroom": ""},
    "Конструкційні матеріали": {"teacher": "Не вказано", "zoom": "", "classroom": ""},
    "Фізика": {"teacher": "Не вказано", "zoom": "", "classroom": ""},
    "Правознавство": {"teacher": "Не вказано", "zoom": "", "classroom": ""},
    "Укр. Літ": {"teacher": "Не вказано", "zoom": "", "classroom": ""}
}

# Расписание по дням
SCHEDULE = {
    "Monday": {},  # В понедельник пар нет
    
    "Tuesday": {
        "1": "Виховна",
        "2": "Фізвиховання",
        "3": "Ін. мова 12а/преп",
        "4": "Укр. Мова"
    },
    
    "Wednesday": {
        "1": "Біологія",
        "2": "Укр. Мова",
        "3": "Конструкційні матеріали",
        "4": "Фізика"
    },
    
    "Thursday": {
        "1": "Конструкційні матеріали",
        "2": "Правознавство",
        "3": "Укр. Літ",
        "4": "Фізвиховання"
    },
    
    "Friday": {
        "1": "Конструкційні матеріали",
        "2": "Біологія",
        "3": "Укр. Мова",
        "4": "Правознавство"
    }
}
